In [2]:
import pandas as pd
import numpy as np

In [6]:
data = np.random.randn(4,3)

In [8]:
data

array([[ 1.14667057, -0.35569463, -1.23439212],
       [-0.124614  , -1.30797084, -2.07436962],
       [ 0.37942901, -0.49053857, -1.26648306],
       [-1.00645599,  1.45646301, -1.13549986]])

In [10]:
dataFrame = pd.DataFrame(data)

In [16]:
type(dataFrame[0])

pandas.core.series.Series

In [18]:
dataFrame

          0         1         2
0  1.146671 -0.355695 -1.234392
1 -0.124614 -1.307971 -2.074370
2  0.379429 -0.490539 -1.266483
3 -1.006456  1.456463 -1.135500

In [40]:
yeniDataFrame = pd.DataFrame(data, index=["Elif","Atil","Zeynep","Atlas"],columns = ["Maas", "Yas","Calisma Saati"])

In [24]:
yeniDataFrame

            maas       Yas  Calisma Saati
Elif    1.146671 -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep  0.379429 -0.490539      -1.266483
Atlas  -1.006456  1.456463      -1.135500

In [26]:
yeniDataFrame["Yas"]

Elif     -0.355695
Atil     -1.307971
Zeynep   -0.490539
Atlas     1.456463
Name: Yas, dtype: float64

In [28]:
yeniDataFrame["Calisma Saati"]

Elif     -1.234392
Atil     -2.074370
Zeynep   -1.266483
Atlas    -1.135500
Name: Calisma Saati, dtype: float64

In [44]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Elif    1.146671 -0.355695
Atil   -0.124614 -1.307971
Zeynep  0.379429 -0.490539
Atlas  -1.006456  1.456463

In [46]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Elif    1.146671 -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep  0.379429 -0.490539      -1.266483
Atlas  -1.006456  1.456463      -1.135500

In [48]:
yeniDataFrame.loc["Elif"]

Maas             1.146671
Yas             -0.355695
Calisma Saati   -1.234392
Name: Elif, dtype: float64

In [50]:
yeniDataFrame.loc["Atil"]

Maas            -0.124614
Yas             -1.307971
Calisma Saati   -2.074370
Name: Atil, dtype: float64

In [52]:
yeniDataFrame.iloc[1]

Maas            -0.124614
Yas             -1.307971
Calisma Saati   -2.074370
Name: Atil, dtype: float64

In [54]:
yeniDataFrame["Maas"]

Elif      1.146671
Atil     -0.124614
Zeynep    0.379429
Atlas    -1.006456
Name: Maas, dtype: float64

In [56]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [58]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Elif    1.146671 -0.355695      -1.234392       -0.711389
Atil   -0.124614 -1.307971      -2.074370       -2.615942
Zeynep  0.379429 -0.490539      -1.266483       -0.981077
Atlas  -1.006456  1.456463      -1.135500        2.912926

In [60]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1)

            Maas       Yas  Calisma Saati
Elif    1.146671 -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep  0.379429 -0.490539      -1.266483
Atlas  -1.006456  1.456463      -1.135500

In [64]:
yeniDataFrame.drop("Atlas", axis = 0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Elif    1.146671 -0.355695      -1.234392       -0.711389
Atil   -0.124614 -1.307971      -2.074370       -2.615942
Zeynep  0.379429 -0.490539      -1.266483       -0.981077

In [66]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Elif    1.146671 -0.355695      -1.234392       -0.711389
Atil   -0.124614 -1.307971      -2.074370       -2.615942
Zeynep  0.379429 -0.490539      -1.266483       -0.981077
Atlas  -1.006456  1.456463      -1.135500        2.912926

In [70]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace=True)

In [72]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Elif    1.146671 -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep  0.379429 -0.490539      -1.266483
Atlas  -1.006456  1.456463      -1.135500

In [74]:
yeniDataFrame.loc["Elif"]["Calisma Saati"]

np.float64(-1.2343921220017084)

In [76]:
yeniDataFrame.loc["Atlas","Yas"]

np.float64(1.456463009292806)

In [78]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Elif    1.146671 -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep  0.379429 -0.490539      -1.266483
Atlas  -1.006456  1.456463      -1.135500

In [82]:
booleanFrame = yeniDataFrame < 0

In [84]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Elif    1.146671 -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep  0.379429 -0.490539      -1.266483
Atlas  -1.006456  1.456463      -1.135500

In [86]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Elif         NaN -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep       NaN -0.490539      -1.266483
Atlas  -1.006456       NaN      -1.135500

In [88]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Elif         NaN -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep       NaN -0.490539      -1.266483
Atlas  -1.006456       NaN      -1.135500

In [92]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

           Maas       Yas  Calisma Saati
Atlas -1.006456  1.456463        -1.1355

In [94]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Elif    1.146671 -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep  0.379429 -0.490539      -1.266483
Atlas  -1.006456  1.456463      -1.135500

In [96]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Elif  1.146671 -0.355695      -1.234392
1    Atil -0.124614 -1.307971      -2.074370
2  Zeynep  0.379429 -0.490539      -1.266483
3   Atlas -1.006456  1.456463      -1.135500

In [98]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Elif    1.146671 -0.355695      -1.234392
Atil   -0.124614 -1.307971      -2.074370
Zeynep  0.379429 -0.490539      -1.266483
Atlas  -1.006456  1.456463      -1.135500

In [100]:
yeniIndexListesi = ["Eli","Ati","Zey","Atl"]

In [102]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [104]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Index
Elif    1.146671 -0.355695      -1.234392        Eli
Atil   -0.124614 -1.307971      -2.074370        Ati
Zeynep  0.379429 -0.490539      -1.266483        Zey
Atlas  -1.006456  1.456463      -1.135500        Atl

In [108]:
yeniDataFrame.set_index("Yeni Index")

                Maas       Yas  Calisma Saati
Yeni Index
Eli         1.146671 -0.355695      -1.234392
Ati        -0.124614 -1.307971      -2.074370
Zey         0.379429 -0.490539      -1.266483
Atl        -1.006456  1.456463      -1.135500

In [110]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Index
Elif    1.146671 -0.355695      -1.234392        Eli
Atil   -0.124614 -1.307971      -2.074370        Ati
Zeynep  0.379429 -0.490539      -1.266483        Zey
Atlas  -1.006456  1.456463      -1.135500        Atl

In [112]:
yeniDataFrame.set_index("Yeni Index", inplace=True)

In [114]:
yeniDataFrame

                Maas       Yas  Calisma Saati
Yeni Index
Eli         1.146671 -0.355695      -1.234392
Ati        -0.124614 -1.307971      -2.074370
Zey         0.379429 -0.490539      -1.266483
Atl        -1.006456  1.456463      -1.135500

In [116]:
yeniDataFrame.loc["Ati"]

Maas            -0.124614
Yas             -1.307971
Calisma Saati   -2.074370
Name: Ati, dtype: float64

In [118]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park", "South Park"]

In [120]:
icIndeksler = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [122]:
birlesmisIndeks = list(zip(ilkIndeksler, icIndeksler))

In [124]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [126]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [128]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [130]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [140]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [142]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFİlmNumpyDizisi,index=birlesmisIndeks,columns=["yas","Meslek"])

In [144]:
cizgiFilmDataFrame

                   yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [148]:
cizgiFilmDataFrame.loc["Simpson"]

      yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [152]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

yas       10
Meslek     E
Name: Kenny, dtype: object

In [154]:
cizgiFilmDataFrame

                   yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [156]:
cizgiFilmDataFrame.index.names = ["Film Adı", "İsim"]

In [158]:
cizgiFilmDataFrame

                   yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F